#include <iostream>
#include <cmath>

int main()
{
    using namespace std;
    setlocale(LC_ALL, "Russian");

    float x = 0.0f, y = 0.0f, z = 0.0f;
    while (true)
    {
        cout << "Введите размеры бруска: ";
        cin >> x >> y >> z;
        if (x > 0 && y > 0 && z > 0) break;
        cout << "Ошибка! Введённые размеры должны быть положительными. Введите снова.\n";
    }

    x = floor(x / 5);   y = floor(y / 5);   z = floor(z / 5);

    if (x < 1 || y < 1 || z < 1) cout << "Из бруска таких размеров не получится сделать ни одного кубика нужного размера\n";
    else
    {
        float result = x * y * z;
        cout << "Из этого бруска можно изготовить " << result << " кубиков.\n";
        float cubeSide = floor(cbrt(result));
        if (cubeSide < 2) cout << "Из данного количества кубиков не получится собрать набор.\n";
        else cout << "Из них можно составить набор из " << pow(cubeSide, 3) << " кубиков.\n";
    }
    return 0;
}

/*Задача 4. Игрушечная история

    Вы решили открыть бизнес по производству игровых деревянных кубиков для детей. Вы узнали, что лучше всего продаются 
кубики со стороной 5 сантиметров в наборах по несколько штук, причём кубиков в наборе должно быть достаточно, чтобы сложить
из них один большой куб. Для изготовления кубиков к вам в мастерскую поступают деревянные бруски в форме прямоугольных 
параллелепипедов любых размеров.

    Для оптимизации бизнес-процессов напишите программу, которая по заданным размерам исходного бруска определяет, сколько 
кубиков из него можно изготовить, можно ли из них составить набор для продажи, и если можно, то максимальное число кубиков
в этом наборе. Все кубики должны быть из цельного дерева без использования клея. Размеры бруска — вещественные числа. 
Обеспечьте контроль ввода.


Пример
Ввод:

Введите размеры бруска

X: 5;

Y: 35.76;

Z: 35.05.


Вывод:

Из этого бруска можно изготовить 49 кубиков.

Из них можно составить набор из 27 кубиков.*/